{"podcast_details": {"podcast_title": "Football Daily", "episode_title": "Doku heads to Man City, Dyche with work to do at Everton", "episode_image": "http://ichef.bbci.co.uk/images/ic/3000x3000/p0g7t1cx.jpg", "episode_transcript": " This is the BBC. This podcast is supported by advertising outside the UK. BBC Sounds, music, radio, podcasts. The Football Daily Podcast from BBC Radio 5 Live. Hello and welcome to the Football Daily Podcast. I'm Kelly Summers. Coming up, we're going to take a look at Everton's tricky start to the season and we'll also talk Tottenham as the Ange-Postocoblou revolution takes shape. And who better to talk Spurs than former captain Ledley King. Ledley, I'm sure you're enjoying watching Spurs so far, aren't you? I am, I am very much so. Really impressed with the first game against Brentford. I thought the team deserved the three points really. Last season we had quite a few draws but they were different draws, they felt different. This time it was refreshing to see the team on their front foot controlling the game. And it actually goes back to pre-season. I was away on tour with them in pre-season so I got the chance to see them up close and personal, see them training, watch their first game against West Ham, which they totally dominated there. They had over 30 shots on goal and that was my first glimpse of what was to come really. The team controlling the tempo of the game, controlling the ball from back to front and creating chances. What's great is they've continued that into the first couple of games of the season. So I think all the fans are very excited about what's to come. I can already tell you're excited because that's probably the longest answer you've given me when I've worked with you in the past on Spurs. It's not been easy. We'll dive into that in a little bit more detail in just a moment. And also joining us, the former Lioness Tash Dowie. Tash, we're a couple of days on from England's heartbreaking defeat. I was going to ask if you're over it but I'm at the point now of feeling so incredibly proud. Is that how you're feeling? Absolutely, Kelly. I think that what the girls achieved over there and all the struggles that they had throughout the tournament. Injuries, players missing, penalty shootouts. They had everything. So to reach the World Cup final, create history again, come back with a silver medal. Yeah, they should be really proud. They had a massive effect on girls and boys now. And worldwide, I think the whole tournament was a huge success. It will hurt, I'm sure, for a while. But I think looking back, they'll be really, really proud. Yeah, I love how many young little boys I saw in the streets on Sunday and Monday wearing England football tops. If you do want a more in-depth debrief of where it went wrong for Serena Vigman's side, check out yesterday's Football Daily where Mark Chapman and the Monday Nightclub do take a closer look. But for now, we're kicking off this pod by looking at another big bit of transfer news. Manchester City are close to making the Ren winger Jeremy Doku their third signing of the summer. The Belgian is expected to join on a deal worth more than £55 million. Now, I guess, Ledley, this is to fill the gap left by Riyad Mahrez. I'm hesitant to say there are too many gaps in this City squad, but does it make sense to you, this signing? It's very different to Mahrez. Mahrez was a slower, jinkier player that held onto the ball. Now I look at the new signing, Jeremy, he's more of a dynamic player. He's a player that likes to attack on the outside. A little bit different to what we're used to seeing in City. Normally, they're a team that control the ball, pass, pass, pass their way into the back of the net. So he's a little bit different, but I think Pep's always looking at how he can elevate his team from the last season to this season. What can they do a bit differently? What can they add? And there's no doubt he's a very skillful individual player who's going to cause a lot of problems. You've got 12 goals in 92 games for Rennes, Belgium international, and he played at the World Cup at the end of last year. He's got all the credentials, Tash. Does it look like another shrewd acquisition from Pep Guardiola? It does, doesn't it? I think the great thing for City and for Pep is they're probably one of the only teams in the Premier League that every year doesn't need to do too much. It's just a case of adding one or two extra bodies to their team because of how well-oiled machine they are every year. And a lot of other teams need to rebuild every year to try and compete and to stay in the hunt with City because every year they seem to produce and win this Premier League. So, yeah, I think for Pep and City to be able to let these type of players go, like the likes of Mahrez, they must feel pretty comfortable with who they're bringing in and what they've got. It's not necessarily been an easy summer for them either, has it, Ledley, really, when you look at the players that have left. Aymeric Laporte is expected to become the latest departure to Saudi Arabia. Joao Cancelo heavily linked with Barcelona. There's been a lot of movement out as well as these incomings. There has been, and that can happen when a team has been as successful as City have, especially last season. Players are looking for new challenges and that seems the case. I think they've enjoyed their time thoroughly at Man City. I just think it's a case of looking for a new challenge. But I think we've learned to trust Pep over the years now and trust what players he brings into the football club. He'll bring football players that he believes can take City to the next level, take him another step forward, which you always have to do in the Premier League. So I think we've learned to trust him, whatever players he brings in. All of a sudden, everyone's thinking, OK, who is this guy? Should we have been looking at him a little bit more closely? But I think he's going to be an important squad player. Whether he starts week in, week out, I'm not sure, but he's someone who can definitely come off the bench and add a little injection into their attack. How do you rate the current state of the City squad, Tash? Because also they've got a few injuries in there. Losing Kevin de Bruyne over after the opening game was a huge blow, of course. Yeah, huge, wasn't it? But two and two. And that's the thing with City is they've just got so much talent that when they lose a star player like de Bruyne, and if anyone else in the Premier League lost their best player, I think they would really struggle. But then players step up, Foden's come in and it's been terrific. And they always seem to find a way. And I think that's got to be credit to Pep and the way that he gets his team playing, year in, year out. To consistently perform and to win back to the Premier League and to be challenging every year, that's such a hard task. And every game for them, you know, play teams up their game and basically it's like a cut-line to every other team. So, yeah, you know, de Bruyne is their best player and it's a huge loss, but they always seem to have answers. And, you know, yeah, two wins out of two is pretty impressive, start to the season. Yeah, especially against Newcastle. I think we saw how much that meant to them, didn't we, Ledley? They knew that they had to really grind out the win against Newcastle. They were the better team, let's be honest, but they knew that it was a difficult game. They came out on top and maybe with the injuries and, of course, they'd have had to travel to Athens in midweek as well. They perhaps weren't at their peak, but they got the job done again. No, and that's important for City because, you know, in recent years we've seen them start slowly. You know, it's taken them a while to get into their stride. So, you know, that'll be pleasing for Pep to have come through that game against a very good Newcastle team, full of confidence after their first result. And they ground it out, you know, they were the better team. But what will be pleasing is that, you know, they picked up the points, they'll keep improving, you know, they'll look to bring in maybe one or two more players to improve the squad. And, you know, it's not normally until a little bit later on where you see City really kicking the gear and really put a real string of runs together. So, you know, at the moment that will please Pep the way they got through that game. Now, I do want to talk about Everton and their start to the season. Two games, two defeats and still no goals. And after a miserable campaign last season where they only stayed up on the final day, Saturday's 4-0 defeat to Aston Villa did feel like more of the same. And now Dominic Calvert-Lewin will be on the sidelines this time with a fractured cheekbone. Let's bring in Matt Jones from the Blue Room podcast. Matt, firstly, how are you feeling right now as an Everton fan? Does it just feel like it's been a bit of a continuation of what went wrong at times last season? Yeah, good evening. I think that's an absolutely perfect way to summarise it. I sort of sat there last night watching the end of that Arsenal Crystal Palace game and thinking it doesn't feel like week two of the season, it feels like week 40. Going back to the start of the last one and you could go even further back to the previous campaign, Remington, we're in a relegation battle as well. You see teams at this time of the year with new signings, new managers, new kits, new optimism. And hope going into the new campaign, it just feels like it's very much the same at Everton. That's no surprise when you look at the start of 11 on Sunday and there's only one new face in there who's actually younger. He's been a fine player, but he's 38 years old now and he's playing out of position at left back. Everton continue to make the same mistakes, the same void up front and the same issues in front of goal. To go with it now at the weekend, the team look extremely ropey in defence. So, far from ideal, certainly a way to start a campaign. You mentioned there defensively the struggles that you had on Sunday, but recently it's been the attack that have looked the problematic part of this team. Once again, no Dominic Calvert-Lewin for a spell now. How do you feel watching him go down and how do you feel about the players that are left? I feel really sorry for Calvert-Lewin. Obviously, somebody who has evidence by the way in which he got injured at the weekend, who thrust himself into the game whenever he is available and has worked so hard to get fit. I think the issues we've done over the past 18 months, two years or so have been regards to little muscle strains and that kind of thing, impact injuries. The one on the weekend just felt like a three-corner, it's not really been the sort of injury he's been getting. Everything I've seen is so reliant on him because I think if you're going to build a centre forward for the way that Sean Bice wants to play, who can win challenges in the air, can get the ball down on his chest, can win free-kicks, can run into the channels, then Calvert-Lewin can do all those things and finding a striker who can do all those things is really rare. And then at the other end of the spectrum, you've got Neil Mopé, who is just very ill-suited to that style of football. I feel sorry for him when he's being asked to leave the line in a team where the order of the day is direct football and challenging against centre-ars, because that's not his game at all. So, I've got issues there, absolutely, but these issues are not new. As much as Calvert-Lewin's injury was a freak one, everything should be prepared for Calvert-Lewin being injured, for the most part in the last two years, and unfortunately the club, the director of football and whoever else has been making transfer decisions, I've just not been able to get those players in, but it's certainly not a new issue for Everton, that's for sure. How do you feel about the fans' response to Calvert-Lewin's injury? Yeah, it's absolutely not acceptable. Obviously, it was a small minority and I was in the away myself, and I was disappointed and there were plenty of fans who sort of turned around and looked and sheltered those down, but of course when those things happen, you can hear them on the broadcast. It does get broadcast and it gets amplified, but I think the majority of the fans appreciate that Don is going through it at the moment and he's somebody who has spoken out bravely about his mental health in the past and his struggles there. I think it's beyond doubt how hard he's tried to get back this again and the work that he's put in. As much as it's frustrating for Everton as a football team and for this side's hopes of staying in the Premier League, he's not available to go to Calvert-Lewin. But like I said, this isn't a new issue for Everton. Everton have known that Don is susceptible for injuries for two years now and they've done very little in the market to address that. As a result, the focus is always on Calvert-Lewin, it's always on when he's going to be fit. Sean Dice has asked about it every week, it's often become a run of joking. The press commenters, whatever things should be talking about and what fans should be talking about is, how is our new striker Don, how is our new forward going to come into the team and impact things? Instead, the focus continues to be on Calvert-Lewin because he's the only real function sent forward that Everton have got on the football club. Thank you, Matt, for joining us. Hopefully next time when we get you on, we'll be able to talk about happier things when it comes to Everton. But Tash, when you look at where Everton are at at the moment, I said it before, it does feel like they've got a lot of the same problems from last season. But now Sunday highlighted defensive issues, which perhaps we haven't talked about as much in the past with Everton. Yeah, not much at all. I am massively surprised with regards to their recruitment and just how little they've done. Considering, I think, what Matt's just said, Don, he's knocked it on the head. You know, been in two relegation battles and still not seem to kind of address those areas. And yeah, defensively, you're right, we've probably always focused on, you know, they've struggled to score goals and that's why they've been where they've been come the end of the season. But now it's almost like the defensive issues have come alive as well. It's an issue right now. You know, they've got zero points. Calvert-Lewin again with his injury and I feel so sorry for him as a striker myself. I can't even imagine what he's going through. I think it's a stat that says he's only played 90 minutes four times since last season, which is not ideal really because he is their star center forward and they need him. But yeah, I think they need to bring some players in otherwise it's going to be a long season for them. And I think potentially they could go down if they don't bring some more bodies in this transfer window. Naidu Manoa on this podcast on Sunday kind of alluded to the fact that he felt like a lot of players made a lot of mistakes, had a lot of off days on Sunday. How worried are you for them, Nedley? Yeah, judging by the first two games, I am worried. First game of the season at home to Fulham. You know, there would have been a lot of optimism going into that, that they could kind of put their troubles behind them and get off to a good start at least. And to lose that game was, you know, it was a big blow. But then to lose 4-0 at Villa seems like their troubles are all come piling in at once. Obviously, Calvert-Lewin is their go-to guy. To lose him again is a big, big blow. And I just don't see enough creativity in that team for them. You know, I look at their midfield that they had, you know, they played a 4-1, 4-1, and it's with Adrissa Gaye, Inano and De Corre in the central areas. And, you know, I don't see goals in them three. I don't see too much creativity in them. That's a big problem. That's a big problem. They're going to have to probably go with Mopé, who's a striker that's, you know, he's a small guy that's, you know, relies on good service up to him, balls down the sides, balls to his feet. And that's not a notorious Sean Dyche team playing in. And they've just got to somehow get Delialy fit. You know, he's someone who can get goals, you know, whether he plays behind the striker. And they're building Dan Jumma as well, who's someone who at least wants to attack players and get defenders on their back foot. But they've just got to find a way to be able to create enough chances and score enough goals to keep them in the league. Because, you know, I think the defence has proven that it's not reliable enough to rely on, basically. A lot of mistakes in the Villegue, a lot of individual mistakes. And, you know, it's going to be very worrying for Sean Dyche moving forward now. 72 Plus on the Football Daily Podcast with Aaron Paul. Yes, the 72 Plus is back on the Football Daily Podcast as we see the return of the new EFL football season. Join me and Joey McEnough. You get the tap on the shoulder, right? Go and warm up. And I'm thinking, oh, Kafa, come on, man, I think we're like three or four nil down at this point. And a host of guests every Friday afternoon as we turn the spotlight on the Football League. Who did you sign? Jan Wennegel of Hesselink. We couldn't get it on the back of his shirt. Your chairman put the letters up to £4 a letter, didn't he? He did. From the Championship to League Two and the National Leagues will bring you the biggest names, the biggest interviews and the biggest stories across the football pyramid. 72 Plus on the Football Daily Podcast. Listen and subscribe on BBC Sounds. The Football Daily Podcast from BBC Radio 5 Live. OK, then we'll let's dive deeper into the start of the season for Tottenham now. Something that I know Ledley will be very pleased we're moving on to. You've already alluded to the positivity of the feeling around Spurs. You were with them in pre-season. You've watched at close quarters that opening couple of games. Is it safe to say it feels like a very different club from last season, Ledley? It does. You know, and there's a lot of optimism around the place at the moment. The fans that I speak to, you know, they're buzzing at the moment. They're really happy. You know, a lot of them have said they don't mind if we lose, but let's go out, you know, on our shield. Let's go out playing the style of football that we want to play and get our players, our expressive players playing. Son done an interview recently where he said, you know, players, they want to attack. And this is not a knock on Conte. You know, he had his style. He had his way of being successful. But I just feel that Postokoglu suits the club and what the club's been about over the years. Trying to recruit within as well, you know, bringing players through the academy, young players, giving them opportunities. And we saw that with Sa at the weekend. You know, he's a player that we've had for the last year or so, but, you know, he seemed like a brand new player. And, you know, he's obviously showed his talent and you need managers like Postokoglu who are going to give them the opportunity, give young players the chance, believing in them. You know, I just feel that it's a great fit for the football club at the moment. Obviously, it's a long way to go in the season. We know how difficult it is. But one thing for sure is that the fans are just happy to have an attacking style of football. As a journalist, I've found him so refreshing in press conferences. I love some of the responses he was giving about how he came when he was constantly being asked about him in preseason. I love the answer he gave ahead of the opening weekend about having to stop playing fantasy football because it's not a fantasy anymore. He is a Premier League manager. He's going to entertain us. He seems a character as someone that's seen him a little bit more behind closed doors. Give us an insight into what he's like. Yeah, he's a great character. You know, he's very open. He tells you exactly what he believes. There's no hiding things with him. One of the first things that he spoke to the players about in one of the first meetings was that he wants training to feel like when they were little kids again. That sounds very simple, but when I think back to being a young kid, it was so enjoyable. Football was enjoyable. There was no stresses or worries. You just wanted to go out and play. That's how he wants training to feel. That's really refreshing. And I think that's showing up in the performances at the moment. So he's been great so far. And as I say, there's a lot of optimism around the place at the moment. A draw at Brentford followed by Saturday's win over Manchester United. Tash, what have you made as a neutral of their start to the season? Well, firstly, going on Ange, having played six seasons here in Melbourne, I know how highly he's thought of it. They call it Angeball over there. So I knew and I was really confident he'd have that kind of effect on this Spurs team. And it's great to see. And yeah, I think it's needed. Spurs have had a couple of tough years, haven't they? And I think that to bring in a fresh face and it's not easy. You know, they've had so many new managers that haven't been able to have that impact. And I know it's early days, we're only two games into the season. But I think Ledley, he's in and around it. And I think he can give an honest opinion on that, that it does feel different. And having watched them the first couple of games as well, it does look like these players are playing with a new lease of life and that kind of enjoyment. And it's a great feeling. It's a powerful feeling. And if they can keep this momentum going, I think that's a key. They've had a great start and that can build. Confidence can build, momentum can build. And yeah, I'm really happy for him, actually. I'm pleased as kind of an adopted Aussie, I guess. It's nice to see. As someone who's just come back from working on Australian TV for the Women's World Cup, the excitement over there for Ange and the desire for him to do well. There is a real excitement that he's over here in the Premier League. So I'm sure they've enjoyed the opening couple of games as well. Ledley, also, let's not forget, they are doing this without Harry Kane. That's hard for a manager to come in and have their top striker taken away straight away. Does that make it more impressive? He came into the football club in difficult circumstances, obviously, to have his situation kind of going on, having to answer questions about it. But Harry wanted to go and the club didn't want to lose Harry, but he made it clear that he wasn't going to sign a new contract. And then it's about the club finding the best solution for the player and the football club, more importantly. And I think they managed to do that. I think the chairman managed to do a great job in terms of getting the amount of money that he thought Harry was worth. But also managing to not sell him to a Premier League opposition is important as well. It's really important. Harry is going to do great in Germany. But yeah, difficult circumstances for the manager. I think he would have had a bit of an idea after speaking with Harry on pre-season. But it's never easy. And now a lot of the pressure, if you want to call it that, falls on Richarlison to kind of fill in the void. We know he's very different to Harry. We know he's not the same kind of goal scorer Harry is. But can he chip in with his fair amount of goals? We're hoping he can do that. So when you lose a player like Harry, you're never going to replace it like for like. But it's for the players around to chip in and all do a bit more now. So the front three, the Kulishevskys, even the Solomons coming in, the Suns, can they score? Madison can score goals. Basuma has been excellent in the first two games. He's like a new player for us at the moment. You know, he's got the ability to score. So it's just an all round effort that's needed now to kind of kick on and move on. But there's no doubt that Andrzej has kind of dealt with it great. You know, he's dealt with it really graciously. And as I say, it's not been an easy, easy period of time for him. But that's not shown in the performances from the players. You know, as I say, very optimistic at the moment. Everyone's really enjoying it. Be honest, I'm not trying to bring you down there. How nervous were you seeing James Madison leaving a protective boot on Saturday? Well, someone who's had a fair share of injuries. That wasn't the reason I asked you that then, Lidley. No, no, no, of course not. But no, I know a lot of these things can just be precaution when you're not quite sure after the game exactly what's happened. The best thing is to wear the protective boot, take the pressure off it and then assess it in the incoming days. The great thing was that he played the full 90 minutes. So, you know, I'm optimistic that he'll be fine for the next game. Tell us just a word on who's impressed you because Lidley picked out a few attackers there as well. But the defence also looks like it has a potentially a bit of better balance to it. Oh, it's brilliant, isn't it? I think van de Ven and his partnership with Romero, if you look at the back four, you know, they're all under 25, 23 years old, 25, 22, 20, such youth. And I think that's so exciting for this Spurs team is that they're going to have these players potentially, you know, if performing well, you know, for the next, what, 10 years, 10, 15 years. And I think the Dutch player that's coming, van de Ven, you know, from Wolfsburg has shown such maturity with the way that he's played and that partnership. And I think that's so important that they can get that early partnership and it's clicked straight away. You say you win championships with your defence and I think the Spurs defence in particular have looked solid, which I think is so key because then you know that they've got players in their team that will score goals. I wish I could say the same for Liverpool because right now, you know, we know we're going to score goals, but defensively at the moment we look like we're going to concede as well. But no, credit to Tottenham, they look very solid at the back. I'll tell you what has impressed me very much is that, you know, a lot of people would have said, OK, he's done it up at Celtic or he's done it in the Australian league, but can he do it in the Premier League? Can he bring his style of football into the Premier League and still be successful at that? People looked at the full backs and we know that he likes to have inverted full backs, you know, especially in possession. You know, we looked at the personnel and thought, you know, maybe they're not the players that can really do that, but they've done it and they've been fine. So, you know, that's really impressed me. He's coaching and, you know, the way he's been able to put players into new positions and see them grow from that. So, you know, I'd be really impressed by that. OK, well, that's one half of North London covered. We do now have to cover off the other half of North London. We just wanted to have a quick word on what happened on the Monday night game between Crystal Palace and Arsenal. Now, Arsenal became the third team alongside Brighton and Manchester City to make it two wins from two this season, with Martin Odegaard's penalty proving to be the difference in South London. Now, like with Forrest, Arsenal did have to grind out the win, didn't they, Tash? But given the new faces there, given the change that has gone on there this summer as well, is actually that a good sign than winning when they're not at their best? Yeah, absolutely. I was impressed with Arsenal yesterday watching them. I thought Rice has just fitted into that midfield so well. I thought he had a top performance, what you expect from him. But it's not easy, you know, with the amount of press that was spoken about, how big his move was to fit in so quickly. But you can tell straight away he's a leader in that midfield. I think he's made a big difference to Arsenal with regards to that resilience and grinding out the result. And they did. You know, I think they were in control pretty much. Odegaard, obviously, getting the penalty. I think it was a harsh sending off. I think it was a red card. Tomyasu, I think that the first one, when you look at it, Havertz has had the ball for about 15 seconds and then throws it to Tomyasu, then has it for about six seconds and ends up actually getting the brunt of it from the ref, gets the yellow card. And then I think the second yellow is so soft. You know, he doesn't even like pull his top and, you know, the players made the most of it. And, you know, I think if they appeal that, that will be overturned. But, you know, they've had to play then what, 20 minutes with 10 players and, you know, Crystal Palace piled on the pressure. And it's not easy to go to Palace and to get points, let alone to get three points. So it's a massive, massive win for us, in a way, at home. And, you know, I feel sorry for Palace with the amount of attacking options they have out at the moment. You know, Matthias Franca, Will Hughes, you know, the young kids, Alisi, you know, and you can tell that they're missing those key players. But, yeah, going back to Arsenal, maximum points, two out of two, good start to the season. They also did this, Ledley, despite going down to 10 men. We'll address the decision on that red card in just a moment. But from an Arsenal point of view, the way they responded to that and held on, did that impress you even more? It did. You know, it definitely would have impressed Arteta. You know, Crystal Palace is not an easy fixture. And then to go down to 10 men, you know, they showed great resilience. And that's how titles are won by going to places like Crystal Palace and keeping a clean sheet, grinding it out when you're not at your fluid best. Yeah, that would have pleased them. And as a defender, I know how much one-nils mean. You know, everyone loves to see three-nil, four-nil, but one-nil is a great result for defenders because you know that everyone in your team has put a shift in. And, you know, everyone's had to keep a high level of concentration during the game. You've had to fire, you've had to dig deep. And that's when teams really come together. So, you know, that would have impressed Arteta. OK, then the red card has caused a little bit of controversy, Tash. Takehiro Tomiyasu was booked twice in the second half. Firstly, he took too long to take a throw in. And then in the 67th minute, he was booked for a foul on Jordan Ayu. Replay suggested after that potentially that was a little bit harsh. What were your thoughts on the two yellows and particularly that second one, a reminder Arsenal can't appeal it because it is two yellows and VAR can't intervene either. OK, well, it's really harsh. I watched the first one back and I know the referees are clamping down now on time wasting. And at the time I thought, OK, they've taken a while to take this throw in fair yellow card. Second one, though, hardly touches Ayu, you know, he really makes a meal of it. You know, I think the rest thought maybe tugged a show by actually watching it back. He hardly I don't even think he had contact with him. So I think that second yellow was a real harsh one. But actually, then when you went back and watched the highlights back from the first yellow card, Habert has actually got the ball for about 15 seconds. Throws the ball then to Tomi Asu, who then has it for about six, seven seconds, and he's the one then that ends up getting, you know, booked for it. So I felt a bit sorry for him there, to be honest. But it's a it's a big wake up call for players watching the games now and in the Premier League that, you know, this time wasting isn't going to be tolerated. So, yeah, I feel sorry for him. But and if they can't appeal it, obviously being two yellows, then I think that's an incorrect decision to send them off. Yeah, when Arteta was asked about the red card and the PGM oil's new directive, he said, this is the standards. I don't know how long it was. That was when he was told it was 23 seconds. He said it wasn't. I think it was eight seconds. We might have to play with a stopwatch. It's OK. We won the game. I'm happy. But it probably goes back to what you said about the ball kind of being under possession of different players. So, yeah. Anyway, let's look at what this does kind of for Arsenal, because obviously now Tomi Asu is banned. They've got a bit of a problem at fullback, haven't they, Tash? Because Timber's got a knee injury that he suffered last week, could keep him out for the majority of the season. And Zinchenko's just returned from a calf injury and started on the bench as well. So they've strengthened this squad this summer, but they've already got a problem a couple of games in. Yeah, they have. I think they're probably going to hope that Zinchenko can, you know, find his form sooner and hope that maybe he's, you know, you're probably going to have to push him a little bit more than maybe they would have hoped, to be honest, with regards to what they have in that fullback area now. But I think the good thing is that they've had a good start to the season. I think, you know, maybe if they had not picked up the six points and results hadn't gone their way, this would have been more of an issue. But to get two wins from two, you know, confidence will be high. And I think that will help with this situation. A word on Martin Odegaard as well, Ledley. As a fantasy football manager, I was, I'm a Bucayo Saka owner, so I was surprised when Saka didn't take the penalty. Not disappointed. No comment, maybe slightly. Odegaard did step up and take it. It was Eddie Nketi that was fouled by the Palace goalkeeper, Sam Johnston. Odegaard had a brilliant season last year, as did Saka. It kind of shows, I think, doesn't it, how they've got so many attacking talents. And Arteta kind of said afterwards, the players decide who takes those penalties, which I thought was interesting. Yeah, I mean, obviously, clubs normally have a designated penalty taker. You know, and we've got used to seeing Saka being the guy that steps up for Arsenal. Yeah, it's a strange one for me. I'm not sure what the feeling was behind it because goal scorers and penalty takers, they're normally confident. You know, we haven't seen Saka miss recently. So, yeah, it was a little bit strange, you know, any chance a forward player gets to put his name on the score sheet, you know, we normally see them take that opportunity. But the main thing is that the ball ended up in the net regardless. You know, when the ball ends up in the net, then it's always the right decision. So, yeah, it was a strange one for me. Yeah, I think the last time Saka missed a penalty for Arsenal was back in April against Aston Villa. But Mikael Arteta said when he was asked about Odegaard taking it, he said, I have no clue. It's about leadership of players. And if they felt it was the right thing to do, for me, I'm fine. They have to make those decisions on the pitch. I was surprised, like everybody else, but he scored the goal, which is the important thing. And we won the game. So I guess it goes to show. If he would have missed, I mean, what would he have the same answer? That's the big question. Yeah, I guess that is very, very true. He would have probably said Saka should have taken it. But maybe that does show that the players between them are taking the initiative, taking decisions, stepping up and showing kind of leadership potentially, would you say? Yeah, as I said, I find it strange. Normally there's a penalty. Unless Saka had a problem, players normally want to take their penalties. It's a great opportunity to score a goal. So yeah, I did find it strange. I don't know if he's... I don't believe that it's a lack of confidence at that moment in time or anything like that. Players trust in their ability to stick a penalty away, and they've been on a good run of scoring goals. So yeah, it was a strange one. It'll be interesting to see if that continues throughout the season. I guess we are just speculating without being on the pitch and listening to exactly what they said. We don't have a clue what the reason was. But as Arteta said, it didn't matter because they did get the three points. So Arsenal, as I said, still on a 100% record to start the season alongside Manchester City and Brighton. OK, well, my thanks to Tash and to Ledley and, of course, to Matt Jones for joining us as well. I'll be back tomorrow on the Football Daily, and I'll be joined by Mark Ogden and Stephen Kelly. From all of us here, thanks for listening. Listen on BBC Sounds."}, "podcast_summary": "In today's Football Daily podcast, the team discusses Everton's difficult start to the season and Tottenham's promising start under new manager, Ange Porsda Coglu. Ledley King, former Tottenham captain, expresses his excitement about the team's style of play and the positive atmosphere surrounding the club. They also recognize the impressive performance of Arsenal, who secured a 1-0 victory over Crystal Palace despite going down to 10 men. The controversy surrounding a red card shown to Arsenal's Takehiro Tomiyasu is also discussed. Finally, Martin Odegaard's penalty for Arsenal is analyzed, with manager Mikael Arteta expressing that the decision was made by the players themselves. Overall, the podcast provides a detailed and insightful analysis of the recent happenings in the Premier League.", "podcast_guest": "Ledley Brenton King (born 12 October 1980) is an English former footballer who was a one-club man, spending his entire career at Tottenham Hotspur F.C. and playing 323 competitive matches for the club from 1999 to 2012. He is currently a club ambassador for Tottenham Hotspur.\nHighly rated as a central defender, in 2009 he was named by The Times as Tottenham's 25th best player of all time. From 2002 to 2010, King made 21 international appearances for England, scoring twice and representing the nation at UEFA Euro 2004 and the 2010 FIFA World Cup.\nIn the latter part of his career, King was plagued by chronic knee problems, for which no effective treatment or remedy was found. Instead of training with the rest of the squad King undertook fitness exercises on his own, allowing him to play one first team game per week. His former manager Harry Redknapp called King \"an absolute freak\" for being able to perform at a Premier League level despite not training. Whilst playing, King was cited by opponents and pundits as one of the best defenders in the Premier League.King announced his retirement from all forms of football on 19 July 2012 as a result of the chronic knee injuries that plagued much of his career. In August 2020, King was appointed assistant first team coach to work alongside José Mourinho and other coaching staff at Tottenham.", "podcast_highlights": "- Everton have had a tricky start to the season with two defeats and no goals scored.\n- Former Spurs captain Ledley King is impressed with their performance so far under new manager Ange Puskociclu.\n- Tash Dowie is proud of the efforts of the England women's team in the World Cup final.\n- Manchester City are close to signing winger Jeremy Doku from Ren for over £55 million.\n- City have had a successful start to the season despite missing key players through injury.\n- Matt Jones from the Blue Room podcast is concerned about Everton's lack of signings and defensive issues.\n- Ledley King is optimistic about Spurs under Puskociclu and believes the team is playing with a new lease of life.\n- Arsenal have made a solid start to the season with two wins, but there is controversy around the red card shown to Takehiro Tomiyasu."}