{"podcast_details": {"podcast_title": "Daily Tech Headlines", "episode_title": "Nvidia Sells all the AI Hardware - DTH", "episode_image": "https://assets.pippa.io/shows/619570402eacc3a36070252c/1e111bad-e968-444a-b26b-9a07855179c5.png", "episode_transcript": " Want an ad free version of Daily Tech Headlines and support the show directly? Go to DailyTechHeadlines.com to find out how. These are the Daily Tech Headlines for Thursday, August 24th, 2023. I'm Tom Merritt. Nvidia announced it more than doubled revenue in its latest quarter from six point seven billion dollars last year to thirteen point five one billion this year. Gaming products were part of that, rising 22 percent with the release of the RTX 4060 GPU, the Avatar Cloud Engine and the increase of games using DLSS. But it's AI and data center that really skyrocketed these results up 171 percent on the year. That, of course, includes its H100 GPUs and the HGX box that combines eight of those into one computer. As major cloud service providers added generative models, they bought a lot of hardware from Nvidia. It won't slow down anytime soon, either, as Nvidia projected another rise to 16 billion dollars in revenue this quarter. Several patents were granted to Apple, which isn't unusual. It often refers to products that might never see the light of day. But two of the recently granted patents are worth noting. One is for a virtual reality headset, which isn't surprising, given the announcement of the Apple Vision Pro, right? But the notable thing about this patent is that it was filed May 7th, 2007. That's before the iPhone was released. No word on what took so long to grant it. The second patent of note was for a digital stone. Now, it's hard to make out exactly what it's for, but it's described as a small portable physical object for use in an extended reality system. The system may include a device that allows a user wearer to interact with virtual representations of content, such as stored data or applications overlaid on the user's physical environment. So it basically sounds like something to make virtual objects physical and then move them around in the real world. Apple sent a letter to California State Senator Susan Telemontes Eggman in support of SB 244, a right to repair bill being considered in that state. The bill is similar to one that went into effect in Minnesota in May. It requires manufacturers to offer the means to diagnose, maintain, and repair products. Google announced Wednesday it will require identity verification when you're changing your filters, your forwarding rules, or your IMAP settings in Gmail. Verification includes your second factor codes. That's come into personal accounts as well as Google Workspace. Google also announced 11 new security features for Workspace customers, including several around data loss prevention. Two papers published in the journal Nature from two separate teams show different ways to use algorithms to decode brain patterns and generate speech. One study involved a woman who lost the ability to speak 18 years ago after a brain stem stroke. The other involved a patient with ALS. Both studies implanted a recording device in the brain and then both allowed the patients to speak at around 60 to 70 words per minute. The system used with the stroke patient captured signals that control muscle movements in order to replicate the speech. So it could also replicate small facial movements as well and create a digital avatar. Signals were decoded directly into speech and the avatar could show happy, sad, and surprised facial movements. Recordings from a wedding video were used to train the speech synthesizer to sound like the patient. The system does require connections from a port in the skull to a desktop computer, so it's not yet practical for home use. Meta released a tool to generate code called Code Llama, built on its Llama 2 large language model. Code Llama will use the same license as Llama 2 that makes it free for research and for commercial use by small to medium sized companies. Code Llama comes in three sizes, the smallest of which can run on a single GPU. A video posted on hardware maker MSI's website seems to have included details on Intel's yet to be announced 14th Gen desktop processors. That video is no longer up, but when it was up, it said the 14th Gen processors will be 3% faster than the 13th Gen, have a 17% rise in performance for multi-thread workloads, and showed info indicating that the Core i7-14700K would increase the performance cores from 8 to 12. The video also said the 14th Gen chips will work on existing Z690 and Z790 motherboards. Intel is expected to officially announce the 14th Gen processors during Innovation 2023 next month. South Korea's Naver launched its own large language model tool called HyperClova X on Thursday. It includes a chatbot, similar to chat GPT, and a search engine called QCUE. The service is available in Korean and English. Naver plans to expand the service to Japan and elsewhere in Southeast Asia, and is considering expansions into the Middle East, Spain, and Mexico. Finally, Alphabet's Wing drone delivery company will expand deliveries in two places in the Dallas, Texas area to include orders from local Walmarts. Customers within a six-mile radius of a Walmart in Frisco, Texas, and a second location nearby will be able to have small items delivered by Wing drones right to their house starting in a couple of weeks. For more discussion of the tech news of the day, subscribe to DailyTechNewsShow.com. If you enjoy the show, remember to tell a friend to check it out. Thanks for listening. We'll talk to you next time."}, "podcast_summary": "In today's edition of Daily Tech Headlines, several significant developments in the tech industry were highlighted. Nvidia reported a substantial increase in revenue, doubling its previous year's figure, primarily driven by growth in gaming products and AI data centers. Apple was granted two notable patents, one for a virtual reality headset filed prior to the release of the iPhone, and another for a portable physical object enabling interaction with virtual content in an extended reality system. Additionally, Apple expressed support for a right-to-repair bill in California. Google announced mandatory identity verification for certain actions in Gmail and introduced new security features for Google Workspace. Two separate studies published in Nature showcased algorithms' ability to decode brain patterns and generate speech, enabling patients with speech disabilities to communicate at a reasonable speed. Meta unveiled Code Llama, a tool for generating code based on its Llama 2 large language model. A mistakenly released MSI video shared details about Intel's upcoming 14th Gen desktop processors, highlighting performance improvements over previous generations. In South Korea, Naver launched its own large language model tool, HyperClova X, offering a chatbot and search engine. Lastly, Alphabet's Wing drone delivery service will expand its delivery capabilities to local Walmart locations in the Dallas area, allowing customers within a certain radius to receive small items through drone delivery.", "podcast_guest": "Tom Merritt", "podcast_guest_summary": "Thomas Andrew Merritt (born June 28, 1970) is an American technology journalist, writer, and broadcaster best known as the host of several podcasts. He is a former co-host of Tech News Today on the TWiT.tv Network, and was previously an executive editor for CNET and developer and co-host of the daily podcast Buzz Out Loud. As of March 2023, Merritt hosts Daily Tech News Show, Cordkillers and Sword and Laser, among other programs.\n\n", "podcast_highlights": "- Nvidia's revenue doubled in the latest quarter, with gaming products rising 22% and AI and data center products skyrocketing 171% on the year.\n- Apple was granted patents for a virtual reality headset filed in 2007 and a digital stone for use in extended reality systems.\n- Apple supports a right to repair bill in California, similar to the one in Minnesota, which requires manufacturers to offer repair options for products.\n- Google will require identity verification for certain actions in Gmail, including changing filters and forwarding rules.\n- Two studies published in Nature show different ways algorithms can decode brain patterns and generate speech, allowing patients with speech disabilities to communicate.\n- Meta (formerly Facebook) released Code Llama, a tool for code generation, built on its Llama 2 language model.\n- MSI's website briefly showcased details about Intel's upcoming 14th Gen desktop processors, including performance improvements and compatibility with existing motherboards.\n- South Korea's Naver launched its own large language model called HyperClova X, which includes a chatbot and search engine, and plans to expand its service to other regions.\n- Alphabet's Wing drone delivery company will expand deliveries in the Dallas area to include orders from local Walmarts."}