{"podcast_details": {"podcast_title": "Football Daily", "episode_title": "Will Mo Salah go? & Norwood talks Blades", "episode_image": "http://ichef.bbci.co.uk/images/ic/3000x3000/p0g7t1cx.jpg", "episode_transcript": " This is the BBC. This podcast is supported by advertising outside the UK. BBC Sounds, music, radio, podcasts. This is the Football Daily with Aaron Paul. This is the Friday Football Social with me, Aaron Paul, Michael Brown, David James, and Nigel Rio Coca alongside me for this one. Let's push on and look ahead to some of the action this weekend across the Premier League. The headline fixture sees Newcastle welcome Liverpool to St James' Park. Liverpool are beating in their last 13 top flight games against Newcastle. This could be a real barometer to see how the top six might shape up this season, Michael. Yeah, it's going to be an interesting game. I obviously see Newcastle play last week at Manchester City. I thought they would have been a little bit more attacking. They do a little bit better than obviously what they actually did in the game. I thought they defended well. They had a good shape, as you would expect from Eddie Howard's side. But they didn't create too much going forward when the gaps were there. When I felt like there was the time to play City after obviously the Super Cup in the middle of the week. But you can obviously see how far they've come. They're progressing really well. I think there'd be some great recruitment and I think they really look like a good side. So I think it's possibly a good time to play against Liverpool. Or as you say, there's a slight bit of uncertainty. But we're going to have to see a real improvement from this Liverpool side, especially on their travels. Obviously a slow start against Bournemouth. They managed to get the job done. But yeah, it all bodes for a really, really top game. Do you think there's more to this whole Mo Salah thing right now at Liverpool? That just more than obviously the speculation of him wanting to leave? You know, players perspective, body language. You know, when you see him that Chelsea game and I know Jürgen Klopp tried to downplay it. But do you think there's more to it than that? I think the difficulty is in it with these players. They've been used to so much success, Nigel. In the last few seasons, everything's gone their way. Yes, they've obviously just missed out. But last year's disappointment, he'll be obviously very frustrated that he's not done as well as he was. And that's where he's got to find the performances. He's got to rely on his team, rely on his manager. And they did have obviously a poor season and the body language isn't good. So whether he's looking and thinking, do you know what, it's time for him to go to move on to... Pastures new or whether it's a financial thing if he wants to go to another country, we'll soon see. But it didn't look great. I don't expect the manager to play it any differently. Than what he actually did. But I don't think it's psychologically really that good at this moment in time when you're looking at your star player wanting to possibly leave. Let's hear from Jürgen Klopp, who spoke to the media today and told them that Mo Salah is 100 per cent committed to Liverpool. There's nothing to talk about from our point of view. We don't have another Mo Salah as a Liverpool player. Obviously, for all the things we do, essential was, will be. So, yeah, there's nothing there. If there would be something, the answer would be no. David, would you make the situation that Liverpool face themselves with, look, an embarrassment of riches in attack. But Mo Salah is a vital part of that cog and has been for a long, long time. Yeah, it's interesting to listen to the chaps talking there because what I saw on the first game when Mo came off was a frustrated player who, according to the commentary and obviously the stats, is used to scoring on the opening day of the season. So there's a part of me which would say, I get that frustration. He wanted to say, I only wanted to score a goal against Chelsea, whatever. I think the issue with regards to Saudi Arabia, and I mean, this is going to be, well, it's commonplace now in one sense, but until that transfer window shuts, you know, there is the ridiculous talk of ridiculous amounts of money, which, and if you're thinking in Mo's case, you know, one of the arguments or one of the issues with his signing a new contract to Liverpool was a financial aspect of it. If there was anything in it, then it's understandable until that transfer window shuts. But what you got with Mo is someone, as you've said, who over many, many years has proven himself to be Liverpool's best striker. And therefore, the frustration that he's shown on the field in recent weeks, I just think is what a top striker would be like. Feels like this transfer is only going to happen if Mo Salah pushes for himself. Liverpool aren't going to, they don't want to sell him. No, no, no, no, yeah, you're right Aaron. I mean, I'm not saying that he should go. I'm not saying that Liverpool wanted to go. But ultimately, if the money talks, doesn't it? And if the offer is financially rewardable for Liverpool and obviously for Mo Salah, then it would happen. And we're talking about extreme amounts of money here. So I don't want him to go because he's my fantasy league captain. Well, he was till I changed it this weekend. But yeah, you haven't gone for Harlan. Yeah, and I'm rubbish at fantasy league. So I don't want to go any further on that one. I just thought I'd chuck it in. J Mo, do you know, I think though, for me, I think you look at Liverpool right now, there's been a lot of criticism, their whole transfer spending and what they've done, this transfer window has been an absolute embarrassment for a club like Liverpool. From a business perspective, if they're going to offer 100 million for Mo Salah, he's aged now. You've got to think about it. You've got to be proactive. I know people are going to say, but who do you replace him with? I would go and get Adeyemi from Borussia Dortmund. You've got a young player, you just got 100 million. You've got a player you can develop. Let's be real, Jürgen Klopp's going down that young player route. You still got Darwin Nunes who hasn't really been given a run of games. Is he really going to be this Darwin Nunes that we expect him to be? I think that you've just got to be a bit more proactive. And it's something that definitely Mo Salah could probably want to do. I sense a lot more frustration in him being at Liverpool than probably anything else. You talk about monetary value. What's his value though to Liverpool Football Club, Brownie? Well, it's an excellent question because when you start losing certain senior players and then you're in the transfer market, as Nijs was just saying, in regards to a disaster in the central midfield role, two bids in, two declines, it's like it's the timing of the situation. I think that's the point is you do not want to lose them at any cost at this moment in time. And I think everyone's got the value. I think I'm sure as well with what contracts are on offer. When the clubs come, I think most clubs at this moment in time, whether it be City, whether it be Liverpool, whether it be anybody else, have actually said we cannot stand in the players way. As long as they give us a sensible amount of money. And the amount of money the players get is ridiculous. But the timing of it will be all wrong for Liverpool. One slight issue I want to pick up on is the fact that the Saudi transfer window is open until the 20th of September. That gives them a good old window to keep up in the ante. And it could leave Liverpool in bother if the price is right. Yeah, I think you're right, Aaron. I mean, as I say, the problem is if there's going to be that, and it has to be a huge sum of money, whatever that would be, to draw him away from Liverpool, as Michael pointed out, they'd have to have someone in place to replace him. I just got to bring up one point because I'm not an agreement at all about this farcical transfer speculation or talk about Liverpool. I mean, when you look at the players that they were lined up or supposed to be lined up to get and where they went, I mean, players going to Chelsea, I think it's a fair point. If you're a player being offered a seven or eight year contract, you are more likely to sign it than being offered a four or five year contract because it gives you some sense of a longer sense of security. And I think that's what Liverpool lost out on more than anything else. So that's not down to them. Similarly with Mo, if it happens, as you said, Aaron, after the European transfer window shuts, it will be because Liverpool aren't able to keep the player due to financial assurances or whatever the players are after. So I think it would be difficult. I just hope it doesn't go. Jamie, if they're doing their job right, and normally Liverpool in recruitment have been excellent and gotten key players in key areas that have made the difference. So they've done their job so well for many, many transfer windows. But on this occasion, you know full well from the agent's secretary, who are the other clubs that are bidding for you? And they must know what the deals are on the table and how long it is. But yes, it comes public knowledge that they go and actually get their bids accepted. And then for it not to go, that's why I'm a bit uncertain of it in this particular situation. Well, as I say, I mean, you know, how the industry works, Michael. I mean, Liverpool aren't going to put in an offer and then have, and I say this in the right way, find out whether the player is interested. And therefore it goes down to the player to make a choice. So you go until you've signed the paper, signed the contract, you're not going to be moving anywhere. So, you know, I wouldn't put this down to Liverpool being bad in the transfer market. I just think that the forces that Chelsea are offering or changing, and it's an interesting dynamic because if seven year and eight year contracts are the way forward, then everyone will be doing the same thing. At the moment, Chelsea, the only club are doing it. And I think it's swaying players or it has swayed players to go to Chelsea in the end rather than perhaps what I've seen, especially when Lewton went tonight, a better move would have been going to Anfield. Yeah, Jamie, I think that for me, I disagree with you, mate, because you look at Liverpool and again, they've had a shocking window because for the club that they are and the players available on the market, you look at West Ham getting pretty much nearly Mohamed Kudos. That is a great buy there. Top talent from Europe. You look at Manchester City going after Jeremy Doku. That's another great sign in there. Liverpool have the ability to attract these players, but they haven't been proactive. So for me, again, you've got to look at the business aspect of it now. That's the real world that we're in now. Hundred million for a player of Salah's quality, yes, at his age. From the business perspective, you know that the Fenway group or sports group are going to be looking at that and thinking about that. That's what they're going to do. It's the business side of the game. But you've got Adeyemi, you've got Mokoku still at Dortmund, two young players you can go and get in and replace. Obviously, yes, Salah is indispensable, but you've got to move forward. But again, just before I finish that, let's look at how the game has changed now. The fact you've got Gabriel Vega, the young player from Spain going to the Saudi Pro League, turned down an opportunity to go to the Italian champions Napoli and play Champions League football to go to the Saudi Pro League at 21 years old. Yeah, but you mentioned a great point there with regards to Manchester City. They were after Declan Rice. They put an offer in and didn't get him. Granted, the offer wasn't accepted, but the point is they went for someone publicly, you would argue, and didn't get their man. So not everybody gets who they want without even when they put in, as I say, some sort of public offering. So the nature of football is that not everyone goes to where they expect. I think the difference in Liverpool's case here, Aaron and Mike, is that in the past, you didn't know who Liverpool were getting. They got them and everything was very quiet. I think things now have become much more publicised and therefore if there is an interest, then everyone knows about it before the actual signing. I think what's interesting is that you've put Mo Salah as your captain and you're in a Manchester City WhatsApp group where you keep saying, is it Kane every week? So we can see all the messages. So I mean, it's a bit interesting. I can't wait for the reaction on that, by the way, because they're going to be saying, you've got a lot of Manchester City players in there, Jame-o, as well. So you might have to change your captain. I like losing each week in the fantasy league. That's all I've got to say. He's just trying to be different. He's trying to be awkward. 72 Plus on the Football Daily Podcast with Aaron Paul. Yes, the 72 Plus is back on the Football Daily Podcast as we see the return of the new EFL football season. Join me and Joey McEnough. You get the tap on the shoulder, right? Go warm up. And I'm thinking, oh, come on, man. I think we're like three or four nil down at this point. And a host of guests every Friday afternoon as we turn the spotlight on the Football League. Who did you sign? Jan Venegov of Hesselink. We couldn't get it on the back of his shirt. Your chairman put letters up to £4 a letter, didn't he? He did. From the Championship to League Two and the National Leagues will bring you the biggest names, the biggest interviews and the biggest stories across the football pyramid. 72 Plus on the Football Daily Podcast. Listen and subscribe on BBC Sounds. The Football Daily Podcast with Aaron Paul. Now, let's turn to another story and a big development today on the Luis Robiales situation. The Spanish Football Federation president who kissed Spain's Jenny Almoso on the lips during their World Cup trophy presentation. Robiales has refused to step down and the Spanish government started legal proceedings to try and get him suspended. The Spanish secretary of sports says he wants this to be their me too moment. Let's bring in our Spanish football expert, Guillem Balague. Guillem, good evening. Good evening. Thanks for joining us. I mean, look, the news that we got to us here at the BBC last night was that it was widely reported he was going to be resigning today. This must have come as a huge shock. It'll be worthwhile explaining the context. The story comes from his side. It was leaked by his people to all of us that he was going to resign. And in fact, there was no really all the way out for him as you're going to see in the next day or two because he is going to be moved from office. But to everybody's surprise, media and even people close to him, he actually had prepared a speech in which he said that the case was consensual. He actually says that he had asked Jenny Hermoso if he wanted the case, that she had lifted him a bunch of lies that Jenny has denied in the public statement that has come out with 44 other players in which they decided not to join the national side ever again until he's... But not just him, the directors, the decision makers at the federation have moved out of office. So, yes, a surprise, but it also goes with the person. He believes he's well above the law. I mean, the quotes coming out and the video is extraordinary, isn't it? Rubial is saying, I will not resign, I will not resign. He called it a social assassination. He told an extraordinary General Assembly called by the federation that a social assassination was taking place. What do we expect to happen now? Well, let me say that those things were said and clapped by the audience. And that's perhaps the sadder thing that actually he has some support. The support comes from the fact that the local federation depends on the money, not of the federation, of the president of the federation who distributes the wealth in a way that has not been disclosed. So you are a friend of his, you get money. You clap when he talks, you get money. And many have thought that that's the way to survive and to get money for their hopefully not for their pockets, but it could be generally to build pitches or whatever it is. But that includes the national coach, women and men of Spain. So they're all now being exposed to what they are, a bunch of people that see life in the wrong way. But the government is going to stop that. So, as you said, the Secretary of State for Sport has announced that he's going to take, he's doing an official enquiry on the situation, taking it all up to the highest judicial body, which means that just by this body, by just investigating the case, means that the person has to abandon office temporarily. But there is enough evidence that he will not come back. Then at some point there'll be elections. But the biggest thing is the government now knows, it's visually seen by everyone, that the federation is corrupt. So the thing to do really is to change how the new president gets elected. What's mad, Guillaume, is that we're supposed to be celebrating, or Spain is supposed to be celebrating, the winning and the coronation of a World Cup here. But you know what? They have celebrated it. We all have celebrated it. I was in England, I was the only one celebrated, and then around two miles around me. But this is, and I believe this, this is the Spanish me too. Out of really bad things, good things happen. And quite clearly, it didn't need to be the players doing this fight, but it has been them. And they've exposed the president of the federation and many other people. So now is the time to take advantage and change structures, not just change people. And by the way, not only in the federation, in the media as well. Because for the first couple of days when the kiss happened, people were laughing at it. Like Mina said, it was like, it's just a kiss. Well, you know, who hasn't done that? Well, I haven't, and it shouldn't be done. And by the way, if you are dignified, you should have Rejan, etc. A bunch of things that didn't happen because they think, as I say, they are off the law. So now it's time to change all that. And the government has got an opportunity to do so. And again, finally, we're seeing a lot of backing from the Spanish sort of football industry, if you like. Ica Casillas has sent out a message, Azaz, Aytana Bonmati, David Achea, Alexia Poteas, Borja Eleizas, Arreo Betis. Everyone is kind of backing Hermosa and is making their feelings clear. Is this going to be sort of the revolution of Spanish football now? I hope so. I hope so. The problem is we all knew what Rubiales was like, the government more than any. And he has taken this kind of situation for things to change. But yeah, OK, let's be positive. And I think, as I say, it's an opportunity for everyone to change matters. Fifty five of those players that have signed the public statement say they don't want to play for Spain. A couple of Spanish players, male, have said exactly the same until the directors, not just Rubiales, goes. So let's hope for the best. So we have to thank you all for actually keeping an eye on this, because this tsunami, the social and political tsunami, comes really from all over the world. And even though he has not read the room, I think we're shouting very clearly that him and his attitudes and that way of thinking really out of place now. OK, thank you. There's more on this story on the BBC Sport website and app. Let's turn our attention, though, to Five Lives Premier League Sunday this weekend. We've got back to back commentaries for you at half past four. It's Newcastle versus Liverpool from St James' Park. But before that, we'll be at Bramall Lane as newly promoted Sheffield United. Welcome treble winners Manchester City. Delighted to say joining us now is the Blades midfielder, Oli Norwood. Oli, how are you, pal? How's your summer been? Yeah, all good. Thank you. Very good. Obviously, I'm on the back of another promotion back in the Premier League, where obviously we all want to be. So it was a good summer. And although it's been a bit of a reality check, the first two games, the way it's gone, it's enjoyable to be back. Back in the Premier League once again. What's different this time? You've done it a different way under Paul Hackingbottom, but it felt last season that it didn't all go swimmingly. You had to battle hard. Yeah, we did. I mean, it was well documented, the amount of injuries we had, the amount of players we had missing through certain periods. The difference, obviously, everybody will know that the difference in the Premier League is it's ruthless. You give one opportunity away, it ends up in the back of your net. And we found that out at Forest last Friday night. I don't think we played particularly bad. The cross comes in and Wood heads it in the far corner, and that's the difference that wins the game for them. How have you found the start of the season? Do you know, obviously, delighted, you say you probably partied at the end of the season, enjoyed the promotion, fantastic achievement. I'm sure you're used to knowing that group of players that you did. You had a really good summer. I know where you went as well, by the way. I think it was Las Vegas, was it not? Yeah, it was, yeah. Were you leading it? Were you right, old guy? No, no. You sure? Stay out of the way. Just behaving now, sensible, the old set of standards. I'm an old man now, I'm getting older. Well, you're not that old, mate, but yeah, I get your point. But anyway, you need to get some sleep ready for the weekend, we know that. But what I'm saying is, when you watch your squad of players going into the season, and you're waiting for transfers, you're waiting for opportunities, there being obviously some restraints on the football club, it must have been a psychological blow to lose the two players, Illumina and Jai and Sandberg, you know them so well, and as I said, watched most of your games last season. How have you found that as a group, psychologically, going into the Premier League? Yeah, I mean, you lose two players of that quality, especially for ourselves. You know, we've got a real experienced group, we've got a group that's been together for a long time, as you know, as much as anyone, you know, the football club, you know, what the fans demand of players, and, you know, we felt if we'd have had them too, you know, there'd have been a massive difference for us, you know, the real quality players, and if any team lost the two, you know, best players just before the week, before the season starts, then, you know, it'd be a real blow, but especially as you say, without speaking out of turn, you know, that we haven't really brought the players in to replace them, so it's been difficult the start of the season. The first game of the season against Palace was really difficult because you probably saw the team, there was probably a few raised eyebrows at the team that Hecchi selected that day with me and Baschi in midfield. That was where we were at at that moment in time. But, yeah, it was disappointing to see the two lads leave, but, you know, we've brought players in now, they're learning the way that the manager wants to go about things, learning every day in training and the standards that the lads who've been there over the years have set, and they've got to get up to speed quickly because the league's unforgiving, and we need to get points on the board as quickly as possible. I've just got a really mad question because I was at Wembley for the play-off when Luton won, when Luton won. You know, we were all cheering, everything was wonderful, and I've never heard anyone speak about finishing second and getting promoted and how that feels given Burnley get the trophy for winning, Luton get the trophy for coming third. How does it feel? You get a little cup of tea, you get a little, it's a small little trophy to lift up. I mean, the aim from last season was to be promoted, whether that be first or second, it'd be great to be champions, obviously. It would be great to be first place, but you know, the way the league's set out, it's the top two go automatically up to the Premier League and the playoffs, and having missed out the season before at Forest in the semi-final and going through the playoffs, you know, it was something that when we came back the start of last pre-season, we don't want to experience that again, we want to get it wrapped up, and if that's if that's first place, brilliant, if it's second place, brilliant, but let's make sure we get one of the top two spots and make sure, you know, when you get there you enjoy it, and we did that and you know that everything's still the same for getting promoted first and second, so it was no difference whatsoever for us. Well you had a bit more time to plan Vegas, that was a positive. Yeah, it was more time, more time off in the summer, which is obviously nice. It wasn't so nice when obviously, you know, you have that bit longer to yourself and you've got to start thinking about getting fit and what's to come, then an extra couple of weeks off, you know, start to, especially as you get, you know, a little bit more experienced, a little bit older, you know what's to come, you know what to expect, and you know the first two weeks of pre-season are just horrible anyway, I'm not not a big fan of pre-season, but you have to do it, you have to get fit, and you know the intensity that the league's played at, the Premier League's played at now, you know, you've got to be fit, you've got to be robust, and you know, I think we've got a group who can cope with that. Is it the same old scenarios you'd say, are you guys looking at one game at a time, or do you guys have like a group of games and then you've got a prior of how many points you'd like to get out of the group for the remain, like for the season? No, we've never set, we've never set a target as such, it's just each game by each game, because you know, you could set a target for six games, you could play the top six, and you go well, you know, we wanted 10 points from that, and you end up with three or four, because you're playing the top six teams, you know, not just in the, in this country, arguably top six teams in world football, it's that tough of a division, but no, it's each game on its merit, you know, we were disappointed not to have at least a point on the board at the moment, I thought we were decent enough value for a point last week at Forest, we just, I think we lack that little bit of experience just to come away with a point for the last 20 minutes. Forest chucked players on that we didn't have that experience on the bench to try and change the game they did, and they took full advantage of that, and as I say, we, it's just a game by game and take each game as it comes. Oli, Man City on Sunday repeated the FA Cup semi-final, which of course finished 3-0 to Pep Guardiola's side, what's the attitude and the mentality going into this one? You've said it just a minute ago, take it game by game, is this one a free hit? No, I don't think any game in football is a free hit, anything can happen, we're not stupid, we've been in the game long enough to understand that arguably, a lot of people's eyes are on the best team in the world, we've got some of the best players in the world and the best manager in the world, we know what we're up against, but we've worked harder this week in training on a game plan in which we think can suit us and give ourselves an opportunity of maybe getting a result, so as I said, it's what we want to be in the league for, it's why we wanted to be promoted last year to test ourselves against the best players and give it a real good go, get the crowd behind us at Bramall Lane, as Michael knows, it can be a pretty daunting place when you get the crowd up and you get them involved in the game and try and feed off that and use that to our advantage. I think it's going to be an incredible atmosphere, that's for certain, I think everybody getting behind is still the excitement of the Premier League, I thought with your setup in the semi-final, you had that early chance, was it in the Mlingi, you just missed one, and then you're thinking there's your opportunity off the corner and I felt like you limited City's space and I feel, is that something you probably, I mean is it going to be a similar sort of angle that you're coming up against on Sunday? Yeah, I think you've kind of got to, they force you to do that anyway don't they, the way they play, the way you're seeing now the goalkeepers putting in a centre-half instead of putting in goal when they have the ball, which is something new, you know there's something every season. It's nice to have one of those goalkeepers in there, not shouting at you from behind. No, but I mean they're always evolving and always coming up with plans to get the spare man on the ball and that's something that, we took it as long as we could in the semi-final, I think we got 43, 44 minutes and tried to frustrate them as much as we could and on another day Philomene sticks that one away, you never know, we can maybe nick a result, but we're not, you know we know what we're up against, we know it's going to be difficult but you've a group of lads who are going to give it everything, we're going to as you say try and feed off the excitement in the crowd and try and give them something to shout about. Who's Mark in Holland? Probably all 10 of us, it would be a good idea wouldn't it? Nah, they're so neat, not to jinx it, but the lads did really well against him in the cup semi-finals, you know they limited him to not many chances and it was the other fellow who scored a hat-trick so if you stop one the other one's come up with it don't they so it's always difficult, they're a top team and they're full of top players. Oli, best of luck for the weekend, thanks for joining us tonight on Fire Football Social pal. Appreciate it, cheers lads, see you after. Thanks to Sheffield and the United midfielder Oli Nord with us. We're going to talk Manchester City though, they'll be without manager Pep Guardiola this weekend after his emergency back surgery this week, assistant Juanma Lelio is taking charge for the next two games, new signing Jermey Doku is available, Bernardo Silva is fit again and signed a new contract this week. Question is Michael, can he sort of plug that Kevin De Bruyne shape hole in midfield? I think that's the first question, myself and J Mo cover a lot of Manchester City stuff and the questions that keep coming in is who can replace Kevin De Bruyne? I think people can try, Phil Fordham coming off the line, getting on the half turn, you've seen obviously Kovacic getting in some positions, Bernardo Silva wonderful in all different areas, what he can bring to the side, obviously he's missed last sort of week because of an illness, obviously great to have him signed up but I don't think Kevin De Bruyne can be replaced, nobody can do with the ball what he can do in situations from wider areas, you've got to find a different way and I think if any manager can, any group of players can find different styles, different setups, we've seen against Newcastle last week where they were full press on, we haven't experienced the full backs getting so high all last season, he changed it, he allowed Kyle Walker to go, Phil Fordham just swept inside and then with the press on on the three or four with the midfield and the extra one obviously a Kanji coming in as well from that centre-back position, Phil Fordham was free so this is an interesting problems for City, obviously they're going to be without Pep Guardiola and but the side just be going so well, I think the game that's coming up obviously with no manager in this situation they've had a good gap, probably perfect situation going to Sheffield United who are going to find it very tough and then they got another gap with Fulham at home so they're in a really good situation. Michael I was going to say with the new signing that's coming Jeremy Duku, where do you see him fitting in at Man City now? Well I think you know some warmness is pace, what he's got, he also wants to drive the line, push it into different situations, create 1v1s which is something I feel that City had Leroy Sane for down that left-hand side, he would push it and then for the last few seasons we've seen all of the wider players, Jack Grealish come inside, we've seen Riyad Mahrez, we've now seen Phil Fordham in those areas at times who can push the line left-footed rather than coming inside so it might be a natural situation down the flanks where you can actually push line and get a different situation so they have to have different ways of playing this Manchester City side and Pep Guardiola will find a way so yeah I think it's a real different sign and interesting one. David they're active in the market, we talked about Liverpool and the way they do their business, Mateus Nunes from Wolves, is that still a go of Manchester City especially with Doku coming in? Possibly, I mean I'll just go back to what Michael said I think with KDB, I mean you're not going to replace him like flight because there isn't anyone like that in world football, I just think that what I've noticed from last season, O'Harlan comes in and he is a very special player but Pep Guardiola had to change during the course of the season the way that he was playing, I remember speaking to John Stones at one point and how they had to learn how to pass the ball long into Ealing Harlan, already this season what I've seen given the Community Shield and the three other competitive games they had, different styles which we didn't see last season like Michael said and I think whoever they're going for whether it's Nunes or someone else should I say, I think Pep is actually excited about having to do more coaching, actually having to change tactics and I think one of the criticisms from sort of earlier years was that there was no plan B, well I think Pep's got out his technical coaching book whatever he's got and he's got plan A, B, C, D and he's probably experimenting with other ones so KDB not being available is a miss as an individual but I think what it has created is a problem for opposition in what will City be playing like against us whereas the thing in the past it was quite predictable so yeah whether it's Nunes, as I say I think with what City have already got and a manager who is excited, granted he's not going to be there on the weekend, I just see lots of problems for opposition and if you're in that like Bernardo Silva signing, if you're in that City squad at the moment it would be exciting to go into work just to find out what's next. I'd imagine he's the worst patient in the world Pep Guardiola, I mean Leo's talked about the contact, it's continuous by phone, video call, everything, he's watching Sheffield United right now, he's fully focused on the match but he's not doing a video conference because he doesn't want that, he's probably going to be annoying well everyone in hospital if he's still in hospital, those around him at home so we do wish him well with his recovery Pep Guardiola. Their levels won't slacken off though will they Michael? No I think they know full well what the manager expects of them, I think it's come as I said to you, they had a couple of days off this week, be able to then get onto the training ground, plan what they needed to do going forward and I think with the new players coming in, Bernardo Silva obviously it looked like he could have left, he could have been another one to go out the door so I think it's a really important sign in for City because of the flexibility what Bernardo Silva has. So the standards are there, I think they demand it from from each and every one of the group because they know full well that they will be changed, there's possibly Harland at the top of the pitch at this moment in time where you'd say he's the one who'll get a bit more credit than others because he's ready to make those changes, we've seen full well, it doesn't matter who it is, he left Kevin De Bruyne out last season for a couple of games when he felt things needed to be changed and this is De Bruyne which everyone watching and go just leave Kevin, nobody out like Kevin's fine, leave him in there, so the standards are there, that's what's have to be and that's what's expected, this group are actually so well driven, so composed and they won't let the standards drop. That's it for this episode of the Football Daily, the next one will be Sports Report with Mark Chapman and all the results and reaction to Saturday's games. Football is so much more than what happens on the pitch. That is absolutely sensational. That's right, the summer transfer window is wide open and the rumour mill is well and truly working overtime. The Transfer Gossip Daily podcast with Maisie Adam. Will Manchester City just look to consolidate their incredible squad? Can Nottingham Forest leave behind the drama of last season? And surely Chelsea and Everton will settle for some stability. What will happen next? Every weekday throughout August I'll be joined by the Daily Telegraph's Luke Edwards and others to dissect the most tantalising transfer rumours from around the world. The Transfer Gossip Daily podcast. Listen on BBC Sounds."}, "podcast_summary": "In this episode of the Football Daily Podcast, the focus is on the upcoming Premier League matches, specifically the game between Newcastle and Liverpool. The panel discusses the importance of this match in determining the potential positioning of the top six teams this season. They also analyze Newcastle's performance against Man City in the previous week and discuss the possibility of Mo Salah leaving Liverpool. Jurgen Klopp's comments regarding Salah's commitment to the club are played and analyzed. The panel then shifts to discuss the situation of Luis Rubiales, the president of the Spanish Football Federation, who kissed Spain's Jenny Almoso on the lips during a trophy presentation. Rubiales has refused to step down and legal proceedings have been initiated against him. Spanish football expert Guillem Balague provides insights into the situation. The panel then previews the upcoming matches between Sheffield United and Manchester City and discusses the potential impact of Kevin De Bruyne's absence due to injury. They also discuss the signing of Jeremy Doku by Manchester City and potential other transfers the team might make. The show concludes with an interview with Sheffield United midfielder Oli Norwood, who discusses his team's start to the season, their mentality going into the match against Manchester City, and how they plan to play against Pep Guardiola's team. Overall, the episode provides a detailed and in-depth analysis of the upcoming Premier League matches and various football-related news.", "podcast_guest": "Mo Salah", "podcast_guest_summary": "Mohamed Salah Hamed Mahrous Ghaly (Arabic: محمد صلاح حامد محروس غالي, Egyptian Arabic pronunciation: [mæˈħam.mæd sˤɑˈlɑːħ ˈɣæːli]; born 15 June 1992), also known as Mo Salah, is an Egyptian professional footballer who plays as a right winger or forward for Premier League club Liverpool and captains the Egypt national team. Considered one of the best players of his generation and amongst the greatest African players of all time, he is known for his clinical finishing, dribbling and speed.Salah started his senior career in 2010 playing for Al Mokawloon, departing in 2012 to join Basel, where he won two Swiss Super League titles. In 2014, Salah joined Chelsea for a reported fee of £11 million, but limited gametime led to successive loans to Fiorentina and Roma, who later signed him permanently for €15 million. In the 2016–17 season, Salah was a key figure in Roma's unsuccessful title bid, reaching double figures in both goals and assists. In 2017, Salah signed for Liverpool for a then-club record transfer of £36.9 million. In his first season, he set the record for most Premier League goals scored (32) in a 38-game season and helped Liverpool to the 2018 UEFA Champions League Final. Having formed a formidable attacking trio with Roberto Firmino and Sadio Mané after the departure of Philippe Coutinho, Salah went on to be an integral player in the club's Champions League and Premier League title successes the following two seasons, and has since also won the FA Cup and the League Cup. Salah has achieved numerous individual accolades, including two PFA Players' Player of the Year awards, three Premier League Golden Boots, the Premier League Player of the Season, the Premier League Playmaker of the Season, and finished third for the Best FIFA Men's Player in 2018 and 2021. He received the 2018 FIFA Puskás Award for his winning strike in the first Merseyside derby of the 2017–18 season. In 2023, Salah became Liverpool's Premier League top goalscorer, surpassing Robbie Fowler.At international level, Salah represented Egypt at youth level before making his senior debut in 2011. Following his performances at the 2012 Summer Olympics, he was named CAF Most Promising African Talent of the Year. Since then, he finished as runner-up in the 2017 and 2021 Africa Cup of Nations and was top scorer during CAF qualification as Egypt qualified for the 2018 FIFA World Cup. Salah was named CAF African Footballer of the Year (2017 and 2018), BBC African Footballer of the Year (2017 and 2018), and was selected in the 2017 Africa Cup of Nations Team of the Tournament, 2021 Africa Cup of Nations Team of the Tournament and the CAF Team of the Year on several occasions.\nOutside of football, Salah is regarded as a symbol of national pride in Egypt for his achievements and was named in Time magazine’s list of the 100 most influential people in 2019. Salah has also been credited for raising the profile of Liverpool among Egyptians.", "podcast_highlights": "- Newcastle welcome Liverpool to St James' Park\n- Liverpool are unbeaten in their last 13 top flight games against Newcastle\n- Newcastle have made progress and look like a good side\n- Mo Salah's future at Liverpool is uncertain, with speculation about him wanting to leave\n- Salah's body language and frustration suggest there may be more to the situation\n- Jurgen Klopp has stated that Salah is 100% committed to Liverpool\n- Liverpool face a challenge in replacing Salah's quality and impact in midfield\n- Newcastle vs Liverpool will be a tough game for both teams\n- Luis Rubiales, president of the Spanish Football Federation, is refusing to step down despite legal proceedings started by the Spanish government\n- Rubiales has been accused of inappropriate behavior after kissing Spain's Jenny Almoso on the lips during a trophy presentation\n- The Spanish government wants this to be their \"me too\" moment\n- Rubiales has support from local federations dependent on his financial distributions\n- A change in the presidency is likely due to the government's investigation\n- Bernardo Silva is fit again and signed a new contract with Manchester City\n- Phil Foden, Jack Grealish, and other players will have to fill the void left by Kevin De Bruyne in midfield\n- Manchester City will have to find different ways of playing without De Bruyne's unique abilities\n- Jeremy Doku, a new signing, brings pace and drive to Manchester City's attack\n- Pep Guardiola will be absent due to emergency back surgery, but City's standards will not slacken\n- Players know what the manager expects of them and will maintain high standards"}